CF/InformationRegisters/КассоваяДисциплинаВыемкиПриЗакрытииСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КассоваяДисциплинаВыемкиПриЗакрытииСмены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипВыемкиПриЗакрытииСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВыемкиПриЗакрытииСмены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСуммаРазмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/ТипыВыемкиПриЗакрытииСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыВыемкиПриЗакрытииСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводитьПолнуюВыемку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОставитьСуммуРазменаВКассеККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыемкуНеПроизводить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/InformationRegisters/КассоваяДисциплинаВыемкиПриЗакрытииСмены/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(Отказ,,Запись.Организация);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.МаксимальнаяСуммаРазмена.Доступность = Запись.ТипВыемкиПриЗакрытииСмены = Перечисления.ТипыВыемкиПриЗакрытииСмены.ОставитьСуммуРазменаВКассеККМ;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипВыемкиПриЗакрытииСменыПриИзменении(Элемент)
	
	Если НЕ Запись.ТипВыемкиПриЗакрытииСмены = ПредопределенноеЗначение("Перечисление.ТипыВыемкиПриЗакрытииСмены.ОставитьСуммуРазменаВКассеККМ") Тогда
		Элементы.МаксимальнаяСуммаРазмена.Доступность = Ложь;
		Запись.МаксимальнаяСуммаРазмена = 0;
	Иначе
		Элементы.МаксимальнаяСуммаРазмена.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
